# VertexPositionNormalColored Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexPositionNormalColored Constructor
VertexPositionNormalColored Class See Also
---
Constructs the vertex from a point, a normal vector, and a color.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public VertexPositionNormalColored(
	XYZ position,
	XYZ normal,
	ColorWithTransparency color
)
```

Visual Basic
---
```text
Public Sub New ( _
	position As XYZ, _
	normal As XYZ, _
	color As ColorWithTransparency _
)
```

Visual C++
---
```text
public:
VertexPositionNormalColored(
	XYZ^ position,
	XYZ^ normal,
	ColorWithTransparency^ color
)
```

# ### Parameters
position
    Type: Autodesk.Revit.DB..::..XYZ The vertex's position.
normal
    Type: Autodesk.Revit.DB..::..XYZ The vertex's normal vector.
color
    Type: Autodesk.Revit.DB..::..ColorWithTransparency The vertex's color.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
VertexPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace